---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableManager.HasSizeTable(System.String)
source: html/7f0f08f7-d73f-759d-6533-e0671b1d56df.htm
---
# Autodesk.Revit.DB.FamilySizeTableManager.HasSizeTable Method

Checks if a FamilySizeTable of a given name exists.

## Syntax (C#)
```csharp
public bool HasSizeTable(
	string tableName
)
```

## Parameters
- **tableName** (`System.String`) - The name of the FamilySizeTable.

## Returns
True if the FamilySizeTable exists, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null